My terraform looks like
`terraform {
  required_providers {
    vcd = {
        source = "local/vmware/vcd"
        version = "3.14.1" # imaginary version
    }
  }
}

provider "vcd" {
    user                 = var.vcd_user
    password             = var.vcd_pass
    org                  = var.vcd_org
    url                  = var.vcd_url
    max_retry_timeout    = var.vcd_max_retry_timeout
    allow_unverified_ssl = var.vcd_allow_unverified_ssl
    auth_type            = "saml_adfs"
    saml_adfs_cookie     = "sso-preferred=yes; sso_redirect_org={{.Org}}"
}

resource "vcd_org" "org" {
    name              = var.tenant_org
    full_name         = var.tenant_org_full
    description       = "The pride of my work"
    is_enabled        = "true"
    delete_recursive  = "true"
    delete_force      = "true"

    vapp_lease {
        maximum_runtime_lease_in_sec          = 0
        power_off_on_runtime_lease_expiration = false
        maximum_storage_lease_in_sec          = 0
        delete_on_storage_lease_expiration    = false
    }

    vapp_template_lease {
        maximum_storage_lease_in_sec       = 0
        delete_on_storage_lease_expiration = false
    }

}

resource "vcd_org_user" "org-admin" {
    org = vcd_org.org.name
    name = var.tenant_org_admin_username
    password = var.tenant_org_admin_password
    description = "Organization Administrator"
    role = "Organization Administrator"
    enabled = true
}
`

Resource vcd_org is created sucessfull, but vcd_org_user is not:

`
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # vcd_org.org will be created
  + resource "vcd_org" "org" {
      + can_publish_catalogs            = true
      + can_publish_external_catalogs   = false
      + can_subscribe_external_catalogs = false
      + delete_force                    = true
      + delete_recursive                = true
      + deployed_vm_quota               = 0
      + description                     = "The pride of my work"
      + full_name                       = "testiranje123"
      + id                              = (known after apply)
      + is_enabled                      = true
      + list_of_catalogs                = (known after apply)
      + list_of_vdcs                    = (known after apply)
      + metadata                        = (known after apply)
      + name                            = "testiranje123"
      + number_of_catalogs              = (known after apply)
      + number_of_vdcs                  = (known after apply)
      + stored_vm_quota                 = 0

      + vapp_lease {
          + delete_on_storage_lease_expiration    = false
          + maximum_runtime_lease_in_sec          = 0
          + maximum_storage_lease_in_sec          = 0
          + power_off_on_runtime_lease_expiration = false
        }

      + vapp_template_lease {
          + delete_on_storage_lease_expiration = false
          + maximum_storage_lease_in_sec       = 0
        }
    }

  # vcd_org_user.org-admin will be created
  + resource "vcd_org_user" "org-admin" {
      + deployed_vm_quota = (known after apply)
      + description       = "Organization Administrator"
      + email_address     = (known after apply)
      + enabled           = true
      + full_name         = (known after apply)
      + group_names       = (known after apply)
      + id                = (known after apply)
      + instant_messaging = (known after apply)
      + is_external       = false
      + is_group_role     = false
      + name              = "testiranje123admin"
      + org               = "testiranje123"
      + password          = (sensitive value)
      + provider_type     = "INTEGRATED"
      + role              = "Organization Administrator"
      + stored_vm_quota   = (known after apply)
      + take_ownership    = false
      + telephone         = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

vcd_org.org: Creating...
vcd_org.org: Creation complete after 4s [id=urn:vcloud:org:8a9ceb2a-4b10-4a1a-aa2a-354433f347f3]
vcd_org_user.org-admin: Creating...
╷
│ Error: [user read] error filling data error retrieving session info: error in HTTP GET request: NOT_AUTHENTICATED - [ 21-2024-08-05-15-22-27-731--eed18412-21c2-414c-9777-75a69fa18eab ] This operation is denied.
│
│   with vcd_org_user.org-admin,
│   on main.tf line 43, in resource "vcd_org_user" "org-admin":
│   43: resource "vcd_org_user" "org-admin" {
│



`

Cloud director log looks like:
`==> /opt/vmware/vcloud-director/logs/2024_08_05.request.log <==
192.168.0.10 - - [05/Aug/2024:13:32:17 +0000] "GET /api/admin/org/283a591e-df4e-4c42-b635-6aac43baaba1 HTTP/1.1" 200 7564 "-" "terraform-provider-vcd/v3.5.0-312-gb849e32 (linux/amd64; isProvider:true)" 131
192.168.0.10 - - [05/Aug/2024:13:32:17 +0000] "GET /api/admin/user/7b285107-f1cb-4903-8d35-7d65fb448479 HTTP/1.1" 200 3867 "-" "terraform-provider-vcd/v3.5.0-312-gb849e32 (linux/amd64; isProvider:true)" 48
192.168.0.10 - - [05/Aug/2024:13:32:17 +0000] "GET /cloudapi/1.0.0/sessions/current HTTP/1.1" 401 163 "-" "terraform-provider-vcd/v3.5.0-312-gb849e32 (linux/amd64; isProvider:true)" 2`


PS. Actually, even "testiranje123admin" vcd_org_user _is_ created inside Cloud Director Organization "testiranje123", but terraform failed during creation.


